{
  "Actions": [
    "Each opponent discards 1 card, mills 1 card, and destroys a creature, enchantment or artifact.[Instant/Sorcery/Enchantment]",
    "The Raid Monster creates ${numberOfPlayers} ${currentRound+1}/${currentRound+1} artifact creature in its colors, each one attacks a seperate player this turn.[Creature]",
    "The Raid Monster creates ${numberOfPlayers} 5/1 deathtouch enchantment artifact creature in its colors, each one attacks a seperate player this turn.[Creature]",
    "For each opponent, destroy target permanent of the player's choice.[Instant/Sorcery/Enchantment]",
    "The Raid Monster deals 6 damage to each player and 3 to each planeswalker.[Instant/Sorcery]",
    "The Raid Monster deals 8 damage to each player and 4 to each planeswalker.[Instant/Sorcery]",
    "The Raid Monster deals 6 damage to each player and 3 to each planeswalker.[Instant/Sorcery]",
    "The Raid Monster deals 8 damage to each player and 4 to each planeswalker.[Instant/Sorcery]",
    "The Raid Monster gains 9 life, removes 5 infect counters, and deals 2 damage to each planeswalker.[Instant/Sorcery]",
    "The Raid Monster gains 9 life, removes 5 infect counters, and deals 2 damage to each planeswalker.[Instant/Sorcery]",
    "The Raid Monster gains 5 life and deals ${diceRolledThisRound} damage to each creature it doesn't control.[Sorcery/Enchantment]",
    "Until the beginning of the Monster’s next turn, players cannot draw more than 2 cards.[Instant/Sorcery/Enchantment]",
    "Until the beginning of the Monster’s next turn, players cannot play more than 2 spells each turn.[Instant/Sorcery/Enchantment]",
    "Each opponent sacrifices half the number of tokens they control rounded down.[Instant/Sorcery/Enchantment]",
    "For each opponent, destroy target enchantment of the player's choice.[Instant/Sorcery/Enchantment]",
    "The Raid Monster creates 1 ${currentRound+1}/${currentRound+1} artifact creature in its colors, and it attacks the player with the highest life total this turn.[Creature]",
    "The Raid Monster creates 4 ${diceRolledThisRound}/${diceRolledThisRound} flying, deathtouch, enchantment artifact creature tokens. All creatures attack each combat if able until the Raid Monsters next turn.[Creature]",
    "Each opponent sacrifices half of the enchantments they control rounded down, or lose life equal to the CMC of the cards that would be sacraficed. Effects that prevent or redirect damage may not be used to counter this loss of life.[Sorcery/Enchantment]",
    "For each opponent, destroy target artifact of the player's choice.[Artifact/Enchantment]",
    "Each opponent sacrifices half the number of artifacts they control rounded down, or lose life equal to the CMC of the cards that would be sacraficed. Effects that prevent or redirect damage may not be used to counter this loss of life.[Sorcery/Enchantment]",
    "Each player exiles 2 artifacts/creatures from their graveyard and drains 6 life.[Instant/Sorcery/Enchantment]",
    "Each player exiles 2 enchantments from their graveyard and drains 6 life.[Instant/Sorcery/Enchantment]",
    "Each player discards 1 card from their hand of their choice.[Instant/Sorcery/Enchantment]",
    "For each opponent, destroy a nonland nontoken permanent with the highest CMC, or lose life equal to the CMC of that permanents. Effects that prevent or redirect damage may not be used to counter this loss of life.[Sorcery/Enchantment]",
    "For each opponent counter the first card played on their next turn.[Instant]",
    "For each opponent, destroy a nonland permanent with the lowest CMC, its controller creates a 1/1 artifact creature.[Instant/Sorcery/Enchantment/Creature]",
    "Each opponent shuffles ${diceRolledThisRound+1} nonland permanents of their choice into their decks, or lose life equal to the CMC of the cards that would be shuffled. Effects that prevent or redirect damage may not be used to counter this loss of life.[Instant/Sorcery/Enchantment]",
    "Each opponent exiles one target non-commander creature of their choice.[Instant/Sorcery]",
    "Until the Raid Monster’s next turn, their life total cannot change by more than half.[Artifact/Enchantment]",
    "Deal 3 damage to each creature and planeswalker.[Sorcery]",
    "Destroy half of each player's nonland permanents with a CMC of 4 or more rounded down.[Sorcery]",
    "Tap all creatures that enter the battlefield until the Raid Monster’s next turn.[Artifact/Enchantment]",
    "Each opponent sacrifices ${diceRolledThisRound} nonland permanents and creates ${diceRolledThisRound+2} treasure tokens.[Instant]",
    "Return 3 nonland permanents to their hand, or lose life equal to the CMC of the cards that would be returned. Effects that prevent or redirect damage may not be used to counter this loss of life.[Sorcery]"
  ]
}
